#+TITLE: Linux/Unix Command and Bash Scripting Overview
#+AUTHOR: Eric Leung
#+DATE: 2018-08-11
#+PROPERTY: header-args :results value drawer replace :exports results :tangle yes

*** echo

The ~echo~ command displays lines of text.

Some reasons you may want to use ~echo~ are:

- output messages to the screen
- printing file names

#+BEGIN_SRC sh
  echo "Hello, World!"
#+END_SRC

#+RESULTS:
:RESULTS:
Hello, World!
:END:

*** head

The ~head~ commands will show just the beginning lines of a given file.

By default, this command will show the first 10 lines of a file.

#+BEGIN_SRC sh
  head ../README.md
#+END_SRC

#+RESULTS:
:RESULTS:
# Teaching Python's NetworkX and Bash

Lecture  materials for teaching Python's NetworkX package and Bash scripting.


**Contents**

- [Requirements](#requirements)
- [Environment Setup](#environment-setup)
    - [Anaconda and Conda](#anaconda-and-conda)
:END:

*** cat

If you want to see more than just the first few lines of a file, you can use
the ~cat~ command to print out the entire file.

This command can also be used to *concatenate* or join multiple files
together.

#+BEGIN_SRC sh :results drawer
  cat ../README.md ../README.md
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

*** Output and Overwrite with >

You can use the ~>~ (greater than symbol) character to take the output of one
program to output and write to another file.

#+BEGIN_SRC sh
  ls ../ > list_of_files.txt
  head list_of_files.txt
#+END_SRC

#+RESULTS:
| notebooks |
| notes     |
| README.md |
| src       |

*** Output and Append with >>

The single greater than sign will overwrite the files you redirect to. But what
if you want to just keep on adding to a list?

That's where the double greater than sign ~>>~ comes in.

This double greater than sign will add to the bottom of the file.

#+BEGIN_SRC sh :results drawer
  # The -e flag tells echo to interpret the backslash
  echo -e "\nCompare with sorted list" >> list_of_files.txt

  ls -lt ../ >> list_of_files.txt
  cat list_of_files.txt
#+END_SRC

#+RESULTS:
:RESULTS:
notebooks
notes
README.md
src

Compare with sorted list
total 8
drwxr-xr-x+ 1 leunge Domain Users    0 Sep  5 13:01 notes
drwxr-xr-x+ 1 leunge Domain Users    0 Aug 23 15:49 notebooks
drwxr-xr-x+ 1 leunge Domain Users    0 Aug 23 15:37 src
-rw-r--r--+ 1 leunge Domain Users 2234 Aug 23 10:45 README.md
:END:

*** Input with <

You can also redirect files *into* commands using the less than symbol, ~<~.

#+BEGIN_SRC sh
  head < list_of_files.txt
#+END_SRC

#+RESULTS:
:RESULTS:
notebooks
notes
README.md
src

Compare with sorted list
total 8
drwxr-xr-x+ 1 leunge Domain Users    0 Sep  5 13:01 notes
drwxr-xr-x+ 1 leunge Domain Users    0 Aug 23 15:49 notebooks
drwxr-xr-x+ 1 leunge Domain Users    0 Aug 23 15:37 src
:END:

Now although this example is superfluous, I hope the concept still shines
through.

** Pipe

The pipe character, ~|~ (generally found above the Enter key), help redirect
output from one command to another

Let's look at what we have so far in our directory.

#+BEGIN_SRC sh :results drawer
  ls
#+END_SRC

#+RESULTS:
:RESULTS:
#unix_outline.org#
list_of_files.txt
unix_outline.org
:END:

Now, say I only want to look at only two entries with the ~head~ command.

#+BEGIN_SRC sh :results drawer
  ls | head -n 2
#+END_SRC

#+RESULTS:
:RESULTS:
#unix_outline.org#
list_of_files.txt
:END:

*** Examples

Now that we have the general syntax, let's try out some ~awk~ commands.

#+BEGIN_SRC sh :results drawer
  ls -l
  ls -l | awk '{ print $6 " " $10 }'
  ls -l | awk '{ print $6 * 2 }'
#+END_SRC

#+RESULTS:
:RESULTS:
total 113
-rw-r--r--+ 1 leunge Domain Users 28946 Sep  5 19:04 #unix_outline.org#
-rw-r--r--+ 1 leunge Domain Users   302 Sep  5 13:01 list_of_files.txt
-rw-r--r--+ 1 leunge Domain Users 50823 Sep  5 14:35 unix_outline.html
-rw-r--r--+ 1 leunge Domain Users 24879 Sep  5 14:29 unix_outline.org
 
28946 #unix_outline.org#
302 list_of_files.txt
50823 unix_outline.html
24879 unix_outline.org
0
57892
604
101646
49758
:END:

** cut

The ~cut~ command is useful to divide a file into several parts.

It goes through each line to cut parts of it based on:

- byte position
- character
- field

#+BEGIN_SRC sh :results drawer
  ls -l
  ls -l | cut -b 1-10
#+END_SRC

#+RESULTS:
:RESULTS:
total 113
-rw-r--r--+ 1 leunge Domain Users 29867 Sep  5 19:25 #unix_outline.org#
-rw-r--r--+ 1 leunge Domain Users   302 Sep  5 13:01 list_of_files.txt
-rw-r--r--+ 1 leunge Domain Users 50823 Sep  5 14:35 unix_outline.html
-rw-r--r--+ 1 leunge Domain Users 24879 Sep  5 14:29 unix_outline.org
total 113
-rw-r--r--
-rw-r--r--
-rw-r--r--
-rw-r--r--
:END:

** find

The ~find~ command will be helpful to search for files.

The general form of this command is

#+BEGIN_SRC txt
  find (starting directory) (matching criteria and actions)
#+END_SRC

Here's a table summarizing the types of matching criteria available.

| Criteria   | Description                              |
|------------+------------------------------------------|
| -atime n   | File accessed n days ago                 |
| -mtime n   | File modified n days ago                 |
| -size n    | File is n blocks big (block = 512 bytes) |
| -type c    | File type, f=file,d=dir                  |
| -name nam  | Search filename nam                      |
| -user usr  | File's owner is usr                      |
| -group grp | File's group is grp                      |
| -perm p    | File's access mode is p                  |

Arithmetic modifiers can be used to specify values.

| Modifiers  | Description                          |
|------------+--------------------------------------|
| -mtime +7  | Modified more than seven days ago    |
| -atime -2  | File accessed less than two days ago |
| -size +100 | File larger than 100 blocks (50 KB)  |

#+BEGIN_SRC sh :results drawer
  # Look for text files accessed less than three days ago
  find . -atime -3 -name "*.txt"
#+END_SRC

#+RESULTS:
:RESULTS:
./list_of_files.txt
:END:

** Local Variables

We covered variables very briefly when we talked about the ~$PATH~
variable. This is a built-in variable, but you can also create variables
yourself.

#+BEGIN_SRC sh
  university="Oregon Health & Science University"
  echo $university
#+END_SRC

#+RESULTS:
: Oregon Health & Science University

Mind that there should be *no space* around the equals sign.

And to call the variable, you need the *dollar sign* in front of the variable
name to use it.

Just a tease of what variables can do, you can save the output of one command
into a variable and then use it later.

#+BEGIN_SRC sh
  file_list=$(ls)
  echo $file_list
#+END_SRC

#+RESULTS:
: #unix_outline.org# unix_outline.html unix_outline.org

** Pass In Arguments

Sometimes, instead of hard-coding (explicitly typing in) file names into your
scripts, maybe we'd like our script to work with any file we give it.

Let's create a simple script that will count the number of lines a file has and
create a test file.

#+BEGIN_SRC sh :results drawer
  # Create a simple bash script to take in arguments
  echo '#!/usr/bin/env bash
  filename=$1

  if [ -r $filename ]; then
    linecount=$(wc -l < $filename)
    printf "%s has %d lines\n" $filename $linecount
  fi' > count_lines.sh
  cat count_lines.sh

  # The -e flag interprets backslash characters to create new lines with \n
  echo -e "This\nfile\nhas\nseven\nlines\nin\nit" > test_file.txt
  echo "" # Just create a space between results
  cat test_file.txt
#+END_SRC

#+RESULTS:
:RESULTS:
#!/usr/bin/env bash
filename=$1

if [ -r $filename ]; then
  linecount=$(wc -l < $filename)
  printf "%s has %d lines\n" $filename $linecount
fi

This
file
has
seven
lines
in
it
:END:

Now we can run the script we just created using the file we want as an
*argument*.

#+BEGIN_SRC sh :results verbatim
  bash count_lines.sh test_file.txt
#+END_SRC

#+RESULTS:
: test_file.txt has 7 lines

*** if/elif/else blocks

We briefly saw the ~if~ statement being used earlier.

The general syntax using conditional is:

#+BEGIN_SRC txt
  if [ expression ]; then
    Code is 'expression' is true
  fi
#+END_SRC

Here's a working example using ~if~ statements

#+BEGIN_SRC sh
  object="food"
  if [ $object == "car" ]; then
    echo "This is a car"
  elif [ $object == "food" ]; then
    echo "This is food"
  else
    echo "I don't know what this is"
  fi
#+END_SRC

#+RESULTS:
:RESULTS:
This is food
:END:

*** while loops

The ~while~ loop keeps on running a set of commands *while* some condition is
still met.

#+BEGIN_SRC sh
  COUNTER=0
  while [ $COUNTER -lt 10 ]; do
    echo The counter is $COUNTER

    # let allows arithmetic expressions to be evaluated
    let COUNTER+=1
  done
#+END_SRC

#+RESULTS:
:RESULTS:
The counter is 0
The counter is 1
The counter is 2
The counter is 3
The counter is 4
The counter is 5
The counter is 6
The counter is 7
The counter is 8
The counter is 9
:END:

*** for loops

Similar to ~while~ loops, ~for~ loops will iterate over a set of commands. This
type of loop, however, loops over a list of items until that list is done.

#+BEGIN_SRC sh
  # Simple for loop example
  for i in 1 2 3 4; do
    echo $i
  done

  # Another way of the above
  echo
  for i in $(seq 1 4); do  # seq prints sequence of numbers
    echo $i
  done
#+END_SRC

#+RESULTS:
:RESULTS:
1
2
3
4

1
2
3
4
:END:



** Exit Status Indicators for Scripts

Unix and Linux systems have what are called *exit codes* that scripts/programs
can return after it is done running.

These codes indicate whether or not the script passed successfully (~0~),
failed in some way (~1~), or misuse of shell commands (~2~). There are a
variety of other codes for other situations.

Because scripts are typically run in the context of other scripts, it can be
important to know if any one of the inner scripts fail in someway so that you
can fix them.

To access the exit code of the previous script, you can use the ~$?~ variable.

#+BEGIN_SRC sh
  ls %  # <-- This will fail
  echo $?

  bashscript  # <-- Will also fail because non-existant
  echo $?
#+END_SRC

#+RESULTS:
:RESULTS:
2
127
:END:

Here is how you could use these within your own bash scripts.

#+BEGIN_SRC sh
  echo "#!/usr/bin/env bash

  head -n 1 ../README.md

  if [[ $? -eq 0 ]]; then
    echo 'Successfully read beginning of file'; exit 0
  else
    echo 'Failed to read beginning of file'; exit 1
  fi" > test_exit_codes.sh

  bash test_exit_codes.sh
#+END_SRC

#+RESULTS:
:RESULTS:
# Teaching Python's NetworkX and Bash
Successfully read beginning of file
:END:

*** curl

*Note*: the flags below are the letter O (as in ostrich), not the number zero (0).

#+BEGIN_SRC sh
  # Download Python's PEP 20 file
  curl -O https://raw.githubusercontent.com/python/peps/master/pep-0020.txt

  # Do the same thing, but name the downloaded file differently
  curl -o zen.txt https://raw.githubusercontent.com/python/peps/master/pep-0020.txt
#+END_SRC

#+RESULTS:
:RESULTS:
:END:

